# Project 3 - Part 3 (Core)

- Part 3: Construct and export a MySQL database using your data.

In [695]:
import pandas as pd
import os
os.makedirs('Data/',exist_ok=True) 
os.listdir('Data')

['.ipynb_checkpoints',
 'final_DF.csv.gz',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_genres.csv.gz',
 'title_ratings.csv.gz']

# Required Transformation Steps for Title Basics:

- Normalize Genre:

Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:

    - tconst
    - genre_id
2. genres:

    - genre_id
    - genre_name

In [696]:
basics = pd.read_csv('Data/title_basics.csv.gz', low_memory=False)
ratings = pd.read_csv('Data/title_ratings.csv.gz', low_memory=False)
tmdb_api_results = pd.read_csv('Data/final_DF.csv.gz', low_memory=False)

In [697]:
basics=basics.drop(columns=["originalTitle","isAdult","titleType","endYear"])                  
basics.head()

      tconst                                       primaryTitle  startYear  runtimeMinutes                  genres
0  tt0035423                                     Kate & Leopold     2001.0             118  Comedy,Fantasy,Romance
1  tt0062336  The Tango of the Widower and Its Distorting Mi...     2020.0              70                   Drama
2  tt0068865                                Lives of Performers     2016.0              90                   Drama
3  tt0069049                         The Other Side of the Wind     2018.0             122                   Drama
4  tt0088751                                  The Naked Monster     2005.0             100    Comedy,Horror,Sci-Fi

In [698]:
basics['genres_split'] = basics['genres'].str.split(',')

In [699]:
exploded_genres = basics.explode('genres_split')
exploded_genres

          tconst                                       primaryTitle  startYear  runtimeMinutes                     genres genres_split
0      tt0035423                                     Kate & Leopold     2001.0             118     Comedy,Fantasy,Romance       Comedy
0      tt0035423                                     Kate & Leopold     2001.0             118     Comedy,Fantasy,Romance      Fantasy
0      tt0035423                                     Kate & Leopold     2001.0             118     Comedy,Fantasy,Romance      Romance
1      tt0062336  The Tango of the Widower and Its Distorting Mi...     2020.0              70                      Drama        Drama
2      tt0068865                                Lives of Performers     2016.0              90                      Drama        Drama
...          ...                                                ...        ...             ...                        ...          ...
82003  tt9916190                                          Safeguard     2020.0              95  Action,Adventure,Thriller       Action
82003  tt9916190                                          Safeguard     2020.0              95  Action,Adventure,Thriller    Adventure
82003  tt9916190                                          Safeguard     2020.0              95  Action,Adventure,Thriller     Thriller
82004  tt9916362                                              Coven     2020.0              92              Drama,History        Drama
82004  tt9916362                                              Coven     2020.0              92              Drama,History      History

[153827 rows x 6 columns]

In [700]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [701]:
title_genres=exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [702]:
genre_id_map=dict(zip(unique_genres,range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [703]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_id_map)
title_genres=title_genres.drop(columns='genres_split')

In [704]:
genre_map=pd.DataFrame({'genre_name':genre_id_map.keys(),
                       'genre_id':genre_id_map.values()})
genre_map.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [705]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [706]:
#col no longer needed for loading into sql after transformations
basics=basics.drop("genres_split",axis=1)

# Create DB in mySQL & load tables

In [707]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection_str = "mysql+pymysql://root:root@localhost/Movies"
engine = create_engine(connection_str)

The database already exists

In [708]:
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

q = """SELECT *FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

In [709]:
genre_map.to_sql('genres',engine,if_exists='replace',index=False)

q = """SELECT *FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [710]:
basics.dtypes

tconst             object
primaryTitle       object
startYear         float64
runtimeMinutes      int64
genres             object
dtype: object

In [711]:
from sqlalchemy.types import *

key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
gen_len= basics['genres'].fillna('').map(len).max()
df_schema_basics = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    "startYear":Float(),
    "runtimeMinutes":Integer(),
    "genres":Text(gen_len+1)}

basics.to_sql('title_basics',engine,dtype=df_schema_basics,if_exists='replace',index=False)
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [712]:
q = """SELECT *FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

      tconst                                       primaryTitle  startYear  runtimeMinutes                  genres
0  tt0035423                                     Kate & Leopold     2001.0             118  Comedy,Fantasy,Romance
1  tt0062336  The Tango of the Widower and Its Distorting Mi...     2020.0              70                   Drama
2  tt0068865                                Lives of Performers     2016.0              90                   Drama
3  tt0069049                         The Other Side of the Wind     2018.0             122                   Drama
4  tt0088751                                  The Naked Monster     2005.0             100    Comedy,Horror,Sci-Fi

In [713]:
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [714]:
key_len = ratings['tconst'].fillna('').map(len).max()

df_schema_ratings = {
    "tconst": String(key_len+1), 
    "averageRating":Float(),
    "numVotes":Integer()}

ratings.to_sql('title_ratings',engine,dtype=df_schema_ratings,if_exists='replace',index=False)
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

q = """SELECT *FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     87323
1  tt0062336            6.4       179
2  tt0068865            5.4        75
3  tt0069049            6.7      7793
4  tt0088751            5.2       338

In [715]:
dropcols=[                 
"adult",                   
"backdrop_path",            
"belongs_to_collection",                      
"genres",                    
"homepage",                 
"id",                       
"original_language",       
"original_title",         
"overview",                
"popularity",             
"poster_path",              
"production_companies",     
"production_countries",     
"release_date",                             
"runtime",              
"spoken_languages",         
"status",                  
"tagline",                  
"title",                     
"video",                   
"vote_average",             
"vote_count"              
]
tmdb_api_results=tmdb_api_results.drop(dropcols,axis=1)
tmdb_api_results.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0035423  48000000.0  76019048.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271666.0         PG-13

In [716]:
tmdb_api_results.dtypes

imdb_id           object
budget           float64
revenue          float64
certification     object
dtype: object

In [717]:
key_len = tmdb_api_results['imdb_id'].fillna('').map(len).max()
cert_len =tmdb_api_results['certification'].fillna('').map(len).max()

df_schema_api = {
    "imdb_id": String(key_len+1), 
    "budget": Float(),
    "revenue":Float(),
    "certification":Text(cert_len+1)}

tmdb_api_results.to_sql('tmdb_data',engine,dtype=df_schema_api,if_exists='replace',index=False)

q = """SELECT *FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0114447         0.0         0.0          None
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271670.0         PG-13

In [718]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data